----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1          [1, 64, 256, 256]           9,408
       BatchNorm2d-2          [1, 64, 256, 256]             128
              ReLU-3          [1, 64, 256, 256]               0
         MaxPool2d-4          [1, 64, 128, 128]               0
            Conv2d-5         [1, 256, 128, 128]          16,384
       BatchNorm2d-6         [1, 256, 128, 128]             512
              ReLU-7         [1, 256, 128, 128]               0
            Conv2d-8         [1, 256, 128, 128]          18,432
       BatchNorm2d-9         [1, 256, 128, 128]             512
             ReLU-10         [1, 256, 128, 128]               0
           Conv2d-11         [1, 256, 128, 128]          65,536
      BatchNorm2d-12         [1, 256, 128, 128]             512
           Conv2d-13         [1, 256, 128, 128]          16,384
      BatchNorm2d-14         [1, 256, 128, 128]             512
             ReLU-15         [1, 256, 128, 128]               0
       Bottleneck-16         [1, 256, 128, 128]               0
           Conv2d-17         [1, 256, 128, 128]          65,536
      BatchNorm2d-18         [1, 256, 128, 128]             512
             ReLU-19         [1, 256, 128, 128]               0
           Conv2d-20         [1, 256, 128, 128]          18,432
      BatchNorm2d-21         [1, 256, 128, 128]             512
             ReLU-22         [1, 256, 128, 128]               0
           Conv2d-23         [1, 256, 128, 128]          65,536
      BatchNorm2d-24         [1, 256, 128, 128]             512
             ReLU-25         [1, 256, 128, 128]               0
       Bottleneck-26         [1, 256, 128, 128]               0
           Conv2d-27         [1, 256, 128, 128]          65,536
      BatchNorm2d-28         [1, 256, 128, 128]             512
             ReLU-29         [1, 256, 128, 128]               0
           Conv2d-30         [1, 256, 128, 128]          18,432
      BatchNorm2d-31         [1, 256, 128, 128]             512
             ReLU-32         [1, 256, 128, 128]               0
           Conv2d-33         [1, 256, 128, 128]          65,536
      BatchNorm2d-34         [1, 256, 128, 128]             512
             ReLU-35         [1, 256, 128, 128]               0
       Bottleneck-36         [1, 256, 128, 128]               0
           Conv2d-37         [1, 512, 128, 128]         131,072
      BatchNorm2d-38         [1, 512, 128, 128]           1,024
             ReLU-39         [1, 512, 128, 128]               0
           Conv2d-40           [1, 512, 64, 64]          73,728
      BatchNorm2d-41           [1, 512, 64, 64]           1,024
             ReLU-42           [1, 512, 64, 64]               0
           Conv2d-43           [1, 512, 64, 64]         262,144
      BatchNorm2d-44           [1, 512, 64, 64]           1,024
           Conv2d-45           [1, 512, 64, 64]         131,072
      BatchNorm2d-46           [1, 512, 64, 64]           1,024
             ReLU-47           [1, 512, 64, 64]               0
       Bottleneck-48           [1, 512, 64, 64]               0
           Conv2d-49           [1, 512, 64, 64]         262,144
      BatchNorm2d-50           [1, 512, 64, 64]           1,024
             ReLU-51           [1, 512, 64, 64]               0
           Conv2d-52           [1, 512, 64, 64]          73,728
      BatchNorm2d-53           [1, 512, 64, 64]           1,024
             ReLU-54           [1, 512, 64, 64]               0
           Conv2d-55           [1, 512, 64, 64]         262,144
      BatchNorm2d-56           [1, 512, 64, 64]           1,024
             ReLU-57           [1, 512, 64, 64]               0
       Bottleneck-58           [1, 512, 64, 64]               0
           Conv2d-59           [1, 512, 64, 64]         262,144
      BatchNorm2d-60           [1, 512, 64, 64]           1,024
             ReLU-61           [1, 512, 64, 64]               0
           Conv2d-62           [1, 512, 64, 64]          73,728
      BatchNorm2d-63           [1, 512, 64, 64]           1,024
             ReLU-64           [1, 512, 64, 64]               0
           Conv2d-65           [1, 512, 64, 64]         262,144
      BatchNorm2d-66           [1, 512, 64, 64]           1,024
             ReLU-67           [1, 512, 64, 64]               0
       Bottleneck-68           [1, 512, 64, 64]               0
           Conv2d-69           [1, 512, 64, 64]         262,144
      BatchNorm2d-70           [1, 512, 64, 64]           1,024
             ReLU-71           [1, 512, 64, 64]               0
           Conv2d-72           [1, 512, 64, 64]          73,728
      BatchNorm2d-73           [1, 512, 64, 64]           1,024
             ReLU-74           [1, 512, 64, 64]               0
           Conv2d-75           [1, 512, 64, 64]         262,144
      BatchNorm2d-76           [1, 512, 64, 64]           1,024
             ReLU-77           [1, 512, 64, 64]               0
       Bottleneck-78           [1, 512, 64, 64]               0
           Conv2d-79          [1, 1024, 64, 64]         524,288
      BatchNorm2d-80          [1, 1024, 64, 64]           2,048
             ReLU-81          [1, 1024, 64, 64]               0
           Conv2d-82          [1, 1024, 32, 32]         294,912
      BatchNorm2d-83          [1, 1024, 32, 32]           2,048
             ReLU-84          [1, 1024, 32, 32]               0
           Conv2d-85          [1, 1024, 32, 32]       1,048,576
      BatchNorm2d-86          [1, 1024, 32, 32]           2,048
           Conv2d-87          [1, 1024, 32, 32]         524,288
      BatchNorm2d-88          [1, 1024, 32, 32]           2,048
             ReLU-89          [1, 1024, 32, 32]               0
       Bottleneck-90          [1, 1024, 32, 32]               0
           Conv2d-91          [1, 1024, 32, 32]       1,048,576
      BatchNorm2d-92          [1, 1024, 32, 32]           2,048
             ReLU-93          [1, 1024, 32, 32]               0
           Conv2d-94          [1, 1024, 32, 32]         294,912
      BatchNorm2d-95          [1, 1024, 32, 32]           2,048
             ReLU-96          [1, 1024, 32, 32]               0
           Conv2d-97          [1, 1024, 32, 32]       1,048,576
      BatchNorm2d-98          [1, 1024, 32, 32]           2,048
             ReLU-99          [1, 1024, 32, 32]               0
      Bottleneck-100          [1, 1024, 32, 32]               0
          Conv2d-101          [1, 1024, 32, 32]       1,048,576
     BatchNorm2d-102          [1, 1024, 32, 32]           2,048
            ReLU-103          [1, 1024, 32, 32]               0
          Conv2d-104          [1, 1024, 32, 32]         294,912
     BatchNorm2d-105          [1, 1024, 32, 32]           2,048
            ReLU-106          [1, 1024, 32, 32]               0
          Conv2d-107          [1, 1024, 32, 32]       1,048,576
     BatchNorm2d-108          [1, 1024, 32, 32]           2,048
            ReLU-109          [1, 1024, 32, 32]               0
      Bottleneck-110          [1, 1024, 32, 32]               0
          Conv2d-111          [1, 1024, 32, 32]       1,048,576
     BatchNorm2d-112          [1, 1024, 32, 32]           2,048
            ReLU-113          [1, 1024, 32, 32]               0
          Conv2d-114          [1, 1024, 32, 32]         294,912
     BatchNorm2d-115          [1, 1024, 32, 32]           2,048
            ReLU-116          [1, 1024, 32, 32]               0
          Conv2d-117          [1, 1024, 32, 32]       1,048,576
     BatchNorm2d-118          [1, 1024, 32, 32]           2,048
            ReLU-119          [1, 1024, 32, 32]               0
      Bottleneck-120          [1, 1024, 32, 32]               0
          Conv2d-121          [1, 1024, 32, 32]       1,048,576
     BatchNorm2d-122          [1, 1024, 32, 32]           2,048
            ReLU-123          [1, 1024, 32, 32]               0
          Conv2d-124          [1, 1024, 32, 32]         294,912
     BatchNorm2d-125          [1, 1024, 32, 32]           2,048
            ReLU-126          [1, 1024, 32, 32]               0
          Conv2d-127          [1, 1024, 32, 32]       1,048,576
     BatchNorm2d-128          [1, 1024, 32, 32]           2,048
            ReLU-129          [1, 1024, 32, 32]               0
      Bottleneck-130          [1, 1024, 32, 32]               0
          Conv2d-131          [1, 1024, 32, 32]       1,048,576
     BatchNorm2d-132          [1, 1024, 32, 32]           2,048
            ReLU-133          [1, 1024, 32, 32]               0
          Conv2d-134          [1, 1024, 32, 32]         294,912
     BatchNorm2d-135          [1, 1024, 32, 32]           2,048
            ReLU-136          [1, 1024, 32, 32]               0
          Conv2d-137          [1, 1024, 32, 32]       1,048,576
     BatchNorm2d-138          [1, 1024, 32, 32]           2,048
            ReLU-139          [1, 1024, 32, 32]               0
      Bottleneck-140          [1, 1024, 32, 32]               0
          Conv2d-141          [1, 1024, 32, 32]       1,048,576
     BatchNorm2d-142          [1, 1024, 32, 32]           2,048
            ReLU-143          [1, 1024, 32, 32]               0
          Conv2d-144          [1, 1024, 32, 32]         294,912
     BatchNorm2d-145          [1, 1024, 32, 32]           2,048
            ReLU-146          [1, 1024, 32, 32]               0
          Conv2d-147          [1, 1024, 32, 32]       1,048,576
     BatchNorm2d-148          [1, 1024, 32, 32]           2,048
            ReLU-149          [1, 1024, 32, 32]               0
      Bottleneck-150          [1, 1024, 32, 32]               0
          Conv2d-151          [1, 1024, 32, 32]       1,048,576
     BatchNorm2d-152          [1, 1024, 32, 32]           2,048
            ReLU-153          [1, 1024, 32, 32]               0
          Conv2d-154          [1, 1024, 32, 32]         294,912
     BatchNorm2d-155          [1, 1024, 32, 32]           2,048
            ReLU-156          [1, 1024, 32, 32]               0
          Conv2d-157          [1, 1024, 32, 32]       1,048,576
     BatchNorm2d-158          [1, 1024, 32, 32]           2,048
            ReLU-159          [1, 1024, 32, 32]               0
      Bottleneck-160          [1, 1024, 32, 32]               0
          Conv2d-161          [1, 1024, 32, 32]       1,048,576
     BatchNorm2d-162          [1, 1024, 32, 32]           2,048
            ReLU-163          [1, 1024, 32, 32]               0
          Conv2d-164          [1, 1024, 32, 32]         294,912
     BatchNorm2d-165          [1, 1024, 32, 32]           2,048
            ReLU-166          [1, 1024, 32, 32]               0
          Conv2d-167          [1, 1024, 32, 32]       1,048,576
     BatchNorm2d-168          [1, 1024, 32, 32]           2,048
            ReLU-169          [1, 1024, 32, 32]               0
      Bottleneck-170          [1, 1024, 32, 32]               0
          Conv2d-171          [1, 1024, 32, 32]       1,048,576
     BatchNorm2d-172          [1, 1024, 32, 32]           2,048
            ReLU-173          [1, 1024, 32, 32]               0
          Conv2d-174          [1, 1024, 32, 32]         294,912
     BatchNorm2d-175          [1, 1024, 32, 32]           2,048
            ReLU-176          [1, 1024, 32, 32]               0
          Conv2d-177          [1, 1024, 32, 32]       1,048,576
     BatchNorm2d-178          [1, 1024, 32, 32]           2,048
            ReLU-179          [1, 1024, 32, 32]               0
      Bottleneck-180          [1, 1024, 32, 32]               0
          Conv2d-181          [1, 1024, 32, 32]       1,048,576
     BatchNorm2d-182          [1, 1024, 32, 32]           2,048
            ReLU-183          [1, 1024, 32, 32]               0
          Conv2d-184          [1, 1024, 32, 32]         294,912
     BatchNorm2d-185          [1, 1024, 32, 32]           2,048
            ReLU-186          [1, 1024, 32, 32]               0
          Conv2d-187          [1, 1024, 32, 32]       1,048,576
     BatchNorm2d-188          [1, 1024, 32, 32]           2,048
            ReLU-189          [1, 1024, 32, 32]               0
      Bottleneck-190          [1, 1024, 32, 32]               0
          Conv2d-191          [1, 1024, 32, 32]       1,048,576
     BatchNorm2d-192          [1, 1024, 32, 32]           2,048
            ReLU-193          [1, 1024, 32, 32]               0
          Conv2d-194          [1, 1024, 32, 32]         294,912
     BatchNorm2d-195          [1, 1024, 32, 32]           2,048
            ReLU-196          [1, 1024, 32, 32]               0
          Conv2d-197          [1, 1024, 32, 32]       1,048,576
     BatchNorm2d-198          [1, 1024, 32, 32]           2,048
            ReLU-199          [1, 1024, 32, 32]               0
      Bottleneck-200          [1, 1024, 32, 32]               0
          Conv2d-201          [1, 1024, 32, 32]       1,048,576
     BatchNorm2d-202          [1, 1024, 32, 32]           2,048
            ReLU-203          [1, 1024, 32, 32]               0
          Conv2d-204          [1, 1024, 32, 32]         294,912
     BatchNorm2d-205          [1, 1024, 32, 32]           2,048
            ReLU-206          [1, 1024, 32, 32]               0
          Conv2d-207          [1, 1024, 32, 32]       1,048,576
     BatchNorm2d-208          [1, 1024, 32, 32]           2,048
            ReLU-209          [1, 1024, 32, 32]               0
      Bottleneck-210          [1, 1024, 32, 32]               0
          Conv2d-211          [1, 1024, 32, 32]       1,048,576
     BatchNorm2d-212          [1, 1024, 32, 32]           2,048
            ReLU-213          [1, 1024, 32, 32]               0
          Conv2d-214          [1, 1024, 32, 32]         294,912
     BatchNorm2d-215          [1, 1024, 32, 32]           2,048
            ReLU-216          [1, 1024, 32, 32]               0
          Conv2d-217          [1, 1024, 32, 32]       1,048,576
     BatchNorm2d-218          [1, 1024, 32, 32]           2,048
            ReLU-219          [1, 1024, 32, 32]               0
      Bottleneck-220          [1, 1024, 32, 32]               0
          Conv2d-221          [1, 1024, 32, 32]       1,048,576
     BatchNorm2d-222          [1, 1024, 32, 32]           2,048
            ReLU-223          [1, 1024, 32, 32]               0
          Conv2d-224          [1, 1024, 32, 32]         294,912
     BatchNorm2d-225          [1, 1024, 32, 32]           2,048
            ReLU-226          [1, 1024, 32, 32]               0
          Conv2d-227          [1, 1024, 32, 32]       1,048,576
     BatchNorm2d-228          [1, 1024, 32, 32]           2,048
            ReLU-229          [1, 1024, 32, 32]               0
      Bottleneck-230          [1, 1024, 32, 32]               0
          Conv2d-231          [1, 1024, 32, 32]       1,048,576
     BatchNorm2d-232          [1, 1024, 32, 32]           2,048
            ReLU-233          [1, 1024, 32, 32]               0
          Conv2d-234          [1, 1024, 32, 32]         294,912
     BatchNorm2d-235          [1, 1024, 32, 32]           2,048
            ReLU-236          [1, 1024, 32, 32]               0
          Conv2d-237          [1, 1024, 32, 32]       1,048,576
     BatchNorm2d-238          [1, 1024, 32, 32]           2,048
            ReLU-239          [1, 1024, 32, 32]               0
      Bottleneck-240          [1, 1024, 32, 32]               0
          Conv2d-241          [1, 1024, 32, 32]       1,048,576
     BatchNorm2d-242          [1, 1024, 32, 32]           2,048
            ReLU-243          [1, 1024, 32, 32]               0
          Conv2d-244          [1, 1024, 32, 32]         294,912
     BatchNorm2d-245          [1, 1024, 32, 32]           2,048
            ReLU-246          [1, 1024, 32, 32]               0
          Conv2d-247          [1, 1024, 32, 32]       1,048,576
     BatchNorm2d-248          [1, 1024, 32, 32]           2,048
            ReLU-249          [1, 1024, 32, 32]               0
      Bottleneck-250          [1, 1024, 32, 32]               0
          Conv2d-251          [1, 1024, 32, 32]       1,048,576
     BatchNorm2d-252          [1, 1024, 32, 32]           2,048
            ReLU-253          [1, 1024, 32, 32]               0
          Conv2d-254          [1, 1024, 32, 32]         294,912
     BatchNorm2d-255          [1, 1024, 32, 32]           2,048
            ReLU-256          [1, 1024, 32, 32]               0
          Conv2d-257          [1, 1024, 32, 32]       1,048,576
     BatchNorm2d-258          [1, 1024, 32, 32]           2,048
            ReLU-259          [1, 1024, 32, 32]               0
      Bottleneck-260          [1, 1024, 32, 32]               0
          Conv2d-261          [1, 1024, 32, 32]       1,048,576
     BatchNorm2d-262          [1, 1024, 32, 32]           2,048
            ReLU-263          [1, 1024, 32, 32]               0
          Conv2d-264          [1, 1024, 32, 32]         294,912
     BatchNorm2d-265          [1, 1024, 32, 32]           2,048
            ReLU-266          [1, 1024, 32, 32]               0
          Conv2d-267          [1, 1024, 32, 32]       1,048,576
     BatchNorm2d-268          [1, 1024, 32, 32]           2,048
            ReLU-269          [1, 1024, 32, 32]               0
      Bottleneck-270          [1, 1024, 32, 32]               0
          Conv2d-271          [1, 1024, 32, 32]       1,048,576
     BatchNorm2d-272          [1, 1024, 32, 32]           2,048
            ReLU-273          [1, 1024, 32, 32]               0
          Conv2d-274          [1, 1024, 32, 32]         294,912
     BatchNorm2d-275          [1, 1024, 32, 32]           2,048
            ReLU-276          [1, 1024, 32, 32]               0
          Conv2d-277          [1, 1024, 32, 32]       1,048,576
     BatchNorm2d-278          [1, 1024, 32, 32]           2,048
            ReLU-279          [1, 1024, 32, 32]               0
      Bottleneck-280          [1, 1024, 32, 32]               0
          Conv2d-281          [1, 1024, 32, 32]       1,048,576
     BatchNorm2d-282          [1, 1024, 32, 32]           2,048
            ReLU-283          [1, 1024, 32, 32]               0
          Conv2d-284          [1, 1024, 32, 32]         294,912
     BatchNorm2d-285          [1, 1024, 32, 32]           2,048
            ReLU-286          [1, 1024, 32, 32]               0
          Conv2d-287          [1, 1024, 32, 32]       1,048,576
     BatchNorm2d-288          [1, 1024, 32, 32]           2,048
            ReLU-289          [1, 1024, 32, 32]               0
      Bottleneck-290          [1, 1024, 32, 32]               0
          Conv2d-291          [1, 1024, 32, 32]       1,048,576
     BatchNorm2d-292          [1, 1024, 32, 32]           2,048
            ReLU-293          [1, 1024, 32, 32]               0
          Conv2d-294          [1, 1024, 32, 32]         294,912
     BatchNorm2d-295          [1, 1024, 32, 32]           2,048
            ReLU-296          [1, 1024, 32, 32]               0
          Conv2d-297          [1, 1024, 32, 32]       1,048,576
     BatchNorm2d-298          [1, 1024, 32, 32]           2,048
            ReLU-299          [1, 1024, 32, 32]               0
      Bottleneck-300          [1, 1024, 32, 32]               0
          Conv2d-301          [1, 1024, 32, 32]       1,048,576
     BatchNorm2d-302          [1, 1024, 32, 32]           2,048
            ReLU-303          [1, 1024, 32, 32]               0
          Conv2d-304          [1, 1024, 32, 32]         294,912
     BatchNorm2d-305          [1, 1024, 32, 32]           2,048
            ReLU-306          [1, 1024, 32, 32]               0
          Conv2d-307          [1, 1024, 32, 32]       1,048,576
     BatchNorm2d-308          [1, 1024, 32, 32]           2,048
            ReLU-309          [1, 1024, 32, 32]               0
      Bottleneck-310          [1, 1024, 32, 32]               0
          Conv2d-311          [1, 2048, 32, 32]       2,097,152
     BatchNorm2d-312          [1, 2048, 32, 32]           4,096
            ReLU-313          [1, 2048, 32, 32]               0
          Conv2d-314          [1, 2048, 16, 16]       1,179,648
     BatchNorm2d-315          [1, 2048, 16, 16]           4,096
            ReLU-316          [1, 2048, 16, 16]               0
          Conv2d-317          [1, 2048, 16, 16]       4,194,304
     BatchNorm2d-318          [1, 2048, 16, 16]           4,096
          Conv2d-319          [1, 2048, 16, 16]       2,097,152
     BatchNorm2d-320          [1, 2048, 16, 16]           4,096
            ReLU-321          [1, 2048, 16, 16]               0
      Bottleneck-322          [1, 2048, 16, 16]               0
          Conv2d-323          [1, 2048, 16, 16]       4,194,304
     BatchNorm2d-324          [1, 2048, 16, 16]           4,096
            ReLU-325          [1, 2048, 16, 16]               0
          Conv2d-326          [1, 2048, 16, 16]       1,179,648
     BatchNorm2d-327          [1, 2048, 16, 16]           4,096
            ReLU-328          [1, 2048, 16, 16]               0
          Conv2d-329          [1, 2048, 16, 16]       4,194,304
     BatchNorm2d-330          [1, 2048, 16, 16]           4,096
            ReLU-331          [1, 2048, 16, 16]               0
      Bottleneck-332          [1, 2048, 16, 16]               0
          Conv2d-333          [1, 2048, 16, 16]       4,194,304
     BatchNorm2d-334          [1, 2048, 16, 16]           4,096
            ReLU-335          [1, 2048, 16, 16]               0
          Conv2d-336          [1, 2048, 16, 16]       1,179,648
     BatchNorm2d-337          [1, 2048, 16, 16]           4,096
            ReLU-338          [1, 2048, 16, 16]               0
          Conv2d-339          [1, 2048, 16, 16]       4,194,304
     BatchNorm2d-340          [1, 2048, 16, 16]           4,096
            ReLU-341          [1, 2048, 16, 16]               0
      Bottleneck-342          [1, 2048, 16, 16]               0
          Conv2d-343         [1, 128, 128, 128]          32,896
            SELU-344         [1, 128, 128, 128]               0
          Conv2d-345           [1, 128, 64, 64]          65,664
            SELU-346           [1, 128, 64, 64]               0
          Conv2d-347           [1, 128, 32, 32]         131,200
            SELU-348           [1, 128, 32, 32]               0
          Conv2d-349           [1, 128, 16, 16]         262,272
            SELU-350           [1, 128, 16, 16]               0
          Conv2d-351         [1, 128, 128, 128]         589,952
            SELU-352         [1, 128, 128, 128]               0
          Conv2d-353         [1, 128, 128, 128]         147,584
            SELU-354         [1, 128, 128, 128]               0
          Conv2d-355         [1, 512, 128, 128]          66,048
          Conv2d-356         [1, 128, 128, 128]         147,584
            SELU-357         [1, 128, 128, 128]               0
          Conv2d-358         [1, 128, 128, 128]         147,584
            SELU-359         [1, 128, 128, 128]               0
          Conv2d-360         [1, 128, 128, 128]          16,512
          Conv2d-361         [1, 128, 128, 128]         589,952
            SELU-362         [1, 128, 128, 128]               0
          Conv2d-363         [1, 128, 128, 128]         147,584
            SELU-364         [1, 128, 128, 128]               0
          Conv2d-365         [1, 512, 128, 128]          66,048
          Conv2d-366         [1, 128, 128, 128]         147,584
            SELU-367         [1, 128, 128, 128]               0
          Conv2d-368         [1, 128, 128, 128]         147,584
            SELU-369         [1, 128, 128, 128]               0
          Conv2d-370         [1, 128, 128, 128]          16,512
          Conv2d-371         [1, 128, 128, 128]         589,952
            SELU-372         [1, 128, 128, 128]               0
          Conv2d-373         [1, 128, 128, 128]         147,584
            SELU-374         [1, 128, 128, 128]               0
          Conv2d-375         [1, 512, 128, 128]          66,048
          Conv2d-376         [1, 128, 128, 128]         147,584
            SELU-377         [1, 128, 128, 128]               0
          Conv2d-378         [1, 128, 128, 128]         147,584
            SELU-379         [1, 128, 128, 128]               0
          Conv2d-380         [1, 128, 128, 128]          16,512
          Conv2d-381         [1, 128, 128, 128]         589,952
            SELU-382         [1, 128, 128, 128]               0
          Conv2d-383         [1, 128, 128, 128]         147,584
            SELU-384         [1, 128, 128, 128]               0
          Conv2d-385         [1, 512, 128, 128]          66,048
          Conv2d-386         [1, 128, 128, 128]         147,584
            SELU-387         [1, 128, 128, 128]               0
          Conv2d-388         [1, 128, 128, 128]         147,584
            SELU-389         [1, 128, 128, 128]               0
          Conv2d-390         [1, 128, 128, 128]          16,512
          Conv2d-391         [1, 128, 128, 128]         589,952
            SELU-392         [1, 128, 128, 128]               0
          Conv2d-393         [1, 128, 128, 128]         147,584
            SELU-394         [1, 128, 128, 128]               0
          Conv2d-395         [1, 512, 128, 128]          66,048
          Conv2d-396         [1, 128, 128, 128]         147,584
            SELU-397         [1, 128, 128, 128]               0
          Conv2d-398         [1, 128, 128, 128]         147,584
            SELU-399         [1, 128, 128, 128]               0
          Conv2d-400         [1, 128, 128, 128]          16,512
AdaptiveAvgPool2d-401             [1, 128, 1, 1]               0
          Conv2d-402             [1, 128, 1, 1]          16,512
            SELU-403             [1, 128, 1, 1]               0
          Conv2d-404             [1, 128, 1, 1]          16,512
            SELU-405             [1, 128, 1, 1]               0
          Conv2d-406               [1, 1, 1, 1]             129
         Sigmoid-407               [1, 1, 1, 1]               0
          Conv2d-408          [1, 64, 128, 128]          73,792
            SELU-409          [1, 64, 128, 128]               0
          Conv2d-410           [1, 1, 128, 128]              65
         Sigmoid-411           [1, 1, 128, 128]               0
          Conv2d-412          [1, 64, 128, 128]          73,792
            SELU-413          [1, 64, 128, 128]               0
          Conv2d-414           [1, 3, 128, 128]             195
          Conv2d-415          [1, 64, 128, 128]          73,792
            SELU-416          [1, 64, 128, 128]               0
          Conv2d-417           [1, 3, 128, 128]             195
          Conv2d-418          [1, 64, 128, 128]          73,792
            SELU-419          [1, 64, 128, 128]               0
          Conv2d-420           [1, 3, 128, 128]             195
          Conv2d-421          [1, 64, 128, 128]          73,792
            SELU-422          [1, 64, 128, 128]               0
          Conv2d-423           [1, 3, 128, 128]             195
          Conv2d-424         [1, 128, 128, 128]          65,664
            SELU-425         [1, 128, 128, 128]               0
          Conv2d-426          [1, 64, 128, 128]          73,792
            SELU-427          [1, 64, 128, 128]               0
          Conv2d-428          [1, 64, 128, 128]          36,928
            SELU-429          [1, 64, 128, 128]               0
          Conv2d-430          [1, 15, 128, 128]             975
================================================================
Total params: 93,391,005
Trainable params: 93,391,005
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 3.00
Forward/backward pass size (MB): 5266.13
Params size (MB): 356.26
Estimated Total Size (MB): 5625.39
----------------------------------------------------------------